## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_key_vault.equalvote-argocd will be imported
    resource "azurerm_key_vault" "equalvote-argocd" {
        access_policy                   = [
            {
                application_id          = null
                certificate_permissions = [
                    "Get",
                    "List",
                    "Update",
                    "Create",
                    "Import",
                    "Delete",
                    "Recover",
                    "Backup",
                    "Restore",
                    "ManageContacts",
                    "ManageIssuers",
                    "GetIssuers",
                    "ListIssuers",
                    "SetIssuers",
                    "DeleteIssuers",
                ]
                key_permissions         = [
                    "Get",
                    "List",
                    "Update",
                    "Create",
                    "Import",
                    "Delete",
                    "Recover",
                    "Backup",
                    "Restore",
                    "Decrypt",
                    "Encrypt",
                    "UnwrapKey",
                    "WrapKey",
                    "Verify",
                    "Sign",
                    "Release",
                    "Rotate",
                    "GetRotationPolicy",
                    "SetRotationPolicy",
                ]
                object_id               = "ae6a3fcf-332d-4690-8a04-609e7410da80"
                secret_permissions      = [
                    "Get",
                    "List",
                    "Set",
                    "Delete",
                    "Recover",
                    "Backup",
                    "Restore",
                ]
                storage_permissions     = [
                    "all",
                ]
                tenant_id               = "fb5b09d0-6c7c-4bf2-adf7-6fb61f902de9"
            },
            {
                application_id          = null
                certificate_permissions = []
                key_permissions         = []
                object_id               = "16d17ddb-9a55-4db3-bd3c-b057079093f7"
                secret_permissions      = [
                    "Get",
                ]
                storage_permissions     = []
                tenant_id               = "fb5b09d0-6c7c-4bf2-adf7-6fb61f902de9"
            },
            {
                application_id          = null
                certificate_permissions = []
                key_permissions         = [
                    "Get",
                    "List",
                    "Decrypt",
                    "Encrypt",
                    "UnwrapKey",
                    "WrapKey",
                    "Verify",
                    "Sign",
                ]
                object_id               = "2c7d3739-7134-4112-ae3d-8e3fd181032d"
                secret_permissions      = []
                storage_permissions     = []
                tenant_id               = "fb5b09d0-6c7c-4bf2-adf7-6fb61f902de9"
            },
            {
                application_id          = null
                certificate_permissions = []
                key_permissions         = [
                    "Get",
                    "List",
                    "Encrypt",
                    "Decrypt",
                    "UnwrapKey",
                    "WrapKey",
                    "Verify",
                    "Sign",
                ]
                object_id               = "b0274edd-38b8-49de-8df7-8b50febab361"
                secret_permissions      = []
                storage_permissions     = []
                tenant_id               = "fb5b09d0-6c7c-4bf2-adf7-6fb61f902de9"
            },
            {
                application_id          = null
                certificate_permissions = []
                key_permissions         = [
                    "Get",
                    "List",
                    "Update",
                    "Create",
                    "Import",
                ]
                object_id               = "41f2c14c-70b5-4aea-9360-d09128e28e37"
                secret_permissions      = []
                storage_permissions     = []
                tenant_id               = "fb5b09d0-6c7c-4bf2-adf7-6fb61f902de9"
            },
        ]
        enable_rbac_authorization       = false
        enabled_for_deployment          = false
        enabled_for_disk_encryption     = false
        enabled_for_template_deployment = false
        id                              = "/subscriptions/86f3145a-48cc-4255-8757-dd3104d15e57/resourceGroups/equalvote/providers/Microsoft.KeyVault/vaults/equalvote-argocd/"
        location                        = "westus2"
        name                            = "equalvote-argocd"
        public_network_access_enabled   = true
        purge_protection_enabled        = false
        resource_group_name             = "equalvote"
        sku_name                        = "standard"
        soft_delete_retention_days      = 90
        tags                            = {}
        tenant_id                       = "fb5b09d0-6c7c-4bf2-adf7-6fb61f902de9"
        vault_uri                       = "https://equalvote-argocd.vault.azure.net/"

        network_acls {
            bypass                     = "AzureServices"
            default_action             = "Allow"
            ip_rules                   = []
            virtual_network_subnet_ids = []
        }
    }

  # azurerm_key_vault_access_policy.argocd-policy will be created
  + resource "azurerm_key_vault_access_policy" "argocd-policy" {
      + id              = (known after apply)
      + key_permissions = [
          + "Backup",
          + "Create",
          + "Decrypt",
          + "Delete",
          + "Encrypt",
          + "Get",
          + "Import",
          + "List",
          + "Purge",
          + "Recover",
          + "Restore",
          + "Sign",
          + "UnwrapKey",
          + "Update",
          + "Verify",
          + "WrapKey",
          + "Release",
          + "Rotate",
          + "GetRotationPolicy",
          + "SetRotationPolicy",
        ]
      + key_vault_id    = "/subscriptions/86f3145a-48cc-4255-8757-dd3104d15e57/resourceGroups/equalvote/providers/Microsoft.KeyVault/vaults/equalvote-argocd/"
      + object_id       = "2c7d3739-7134-4112-ae3d-8e3fd181032d"
      + tenant_id       = "fb5b09d0-6c7c-4bf2-adf7-6fb61f902de9"
    }

  # azurerm_user_assigned_identity.argocd-identity will be imported
    resource "azurerm_user_assigned_identity" "argocd-identity" {
        client_id           = "2941dfa2-9dbd-4e67-ae23-4c5ada763f1c"
        id                  = "/subscriptions/86f3145a-48cc-4255-8757-dd3104d15e57/resourceGroups/equalvote/providers/Microsoft.ManagedIdentity/userAssignedIdentities/argocd"
        location            = "westus2"
        name                = "argocd"
        principal_id        = "2c7d3739-7134-4112-ae3d-8e3fd181032d"
        resource_group_name = "equalvote"
        tags                = {}
        tenant_id           = "fb5b09d0-6c7c-4bf2-adf7-6fb61f902de9"
    }

  # kubernetes_service_account.aks-argocd will be created
  + resource "kubernetes_service_account" "aks-argocd" {
      + automount_service_account_token = true
      + default_secret_name             = (known after apply)
      + id                              = (known after apply)

      + metadata {
          + annotations      = {
              + "azure.workload.identity/client-id" = "2941dfa2-9dbd-4e67-ae23-4c5ada763f1c"
              + "azure.workload.identity/tenant-id" = "fb5b09d0-6c7c-4bf2-adf7-6fb61f902de9"
            }
          + generation       = (known after apply)
          + labels           = {
              + "azure.workload.identity/use" = "true"
            }
          + name             = "aks-argocd"
          + namespace        = "argocd"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 2 to import, 2 to add, 0 to change, 0 to destroy.
```
</details>